kirikak2/midori/sdkconfig.defaults
# M5Stack CoreS3 SE with USB Serial Debug settings
# USB is used for serial console, NOT for USB-MIDI host
# CONFIG_USB_MIDI_BOARD_FREENOVE is not set
# CONFIG_USB_MIDI_BOARD_M5STACK_CORES3 is not set
CONFIG_USB_MIDI_BOARD_M5STACK_CORES3_USB_SERIAL=y

# Target
CONFIG_IDF_TARGET="esp32s3"

# Custom partition table
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Enable PSRAM (Quad mode for M5Stack)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
# CONFIG_SPIRAM_MODE_OCT is not set
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y

# Use PSRAM for memory allocation - place BSS in PSRAM
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Compiler optimization for size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# USB Serial/JTAG Console (NOT USB-OTG Host)
# ESP32-S3 has built-in USB Serial/JTAG that works in parallel with USB-OTG
# This configuration uses USB Serial/JTAG for console output
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
